AADSignInEventsBeta
| where AccountUpn == 'John.Doe@gmail.com' //Account email 
| where AuthenticationRequirement == "multiFactorAuthentication"
| where ErrorCode in (50076, 500121, 50079, 53003, 50158 ) //Error codes signifying the actor has the password
| extend ConditionalAccessStatus = case (
ConditionalAccessStatus == 0, "Success",
ConditionalAccessStatus == 1, "Failure",
ConditionalAccessStatus == 2, "Not Applied",
ConditionalAccessStatus == 3, "Unknown",
"Other")                       //Makes codes more human readable 
| project Timestamp,Application, LogonType, Country,State, City,ConditionalAccessStatus,ErrorCode, AuthenticationRequirement, OSPlatform, IPAddress
|order by Timestamp
